Revit 2026 API

# ReferenceBaseOnHostType Enumeration

---

This enumeration is used to classify the Reference Base on Host type .

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ReferenceBaseOnHostType
```
```vb
Public Enumeration ReferenceBaseOnHostType
```
```cpp
public enum class ReferenceBaseOnHostType
```
```fsharp
type ReferenceBaseOnHostType
```

| Member name | Value | Description |
| --- | --- | --- |
| Midpoint | 2 |  |
| PrimaryEnd | 0 |  |
| SecondaryEnd | 1 |  |

#### Reference

Autodesk.Revit.DB Namespace